In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv('HRSalary.csv')

In [3]:
df

         Name  Age  Year Of Experince  Current Salary
0       NQUGN   49                4.0          761802
1       XVIHL   24               23.0          451401
2       NFYDE   54               33.0          757178
3       HUFRV   30               15.0          266478
4       WJHTF   37               17.0          528760
...       ...  ...                ...             ...
199995  RDPOJ   59                9.0          228417
199996  GSZZF   35               38.0          683210
199997  WVGKG   56                2.0          158125
199998  XZRYP   23               34.0          863819
199999  MKTSJ   29               16.0          437604

[200000 rows x 4 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 4 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Name               200000 non-null  object
 1   Age                200000 non-null  int64
 2   Year Of Experince  199999 non-null  float64
 3   Current Salary     200000 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 6.1+ MB

In [5]:
df.isnull().sum()

Name                 0
Age                  0
Year Of Experince    1
Current Salary       0
dtype: int64

In [12]:
df=df.dropna()

In [14]:
df.isnull().sum()

Name                 0
Age                  0
Year Of Experince    0
Current Salary       0
dtype: int64

In [17]:
df.describe()

                 Age  Year Of Experince  Current Salary
count  199999.000000      199999.000000   199999.000000
mean       39.983585          20.491127   510841.180681
std        11.824440          11.535613   283070.834586
min         0.000000           1.000000    20005.000000
25%        30.000000          10.000000   266102.000000
50%        40.000000          20.000000   510757.000000
75%        50.000000          30.000000   756292.000000
max        60.000000          40.000000   999998.000000